In [76]:
import pandas as pd

In [77]:
# creating series that will be input into a dataframe
student_1 = pd.Series({'Name':'Shashwat',
                        'Course':'FAI',
                       'Grade':85})
student_2 = pd.Series({'Name':'Shashwat',
                        'Course':'IR',
                       'Grade':96})
student_3 = pd.Series({'Name':'Aatish',
                        'Course':'CSS',
                       'Grade':92})

In [78]:
# creating a dataframe by specifying a list of indexes
students = pd.DataFrame([student_1, student_2, student_3], index = ['Student 1', 'Student 1', 'Student 3'])
students

          Course  Grade      Name
Student 1    FAI     85  Shashwat
Student 1     IR     96  Shashwat
Student 3    CSS     92    Aatish

In [79]:
students.iloc[0]   # accessing rows in a dataframe using iloc

Course         FAI
Grade           85
Name      Shashwat
Name: Student 1, dtype: object

In [80]:
students.loc['Student 1']  # accessing a particular index using loc

          Course  Grade      Name
Student 1    FAI     85  Shashwat
Student 1     IR     96  Shashwat

In [81]:
type(students.loc['Student 1']) # if there are more than one index they are returned as a dataframe

pandas.core.frame.DataFrame

In [82]:
type(students.loc['Student 3']) # else a single row is returned as a series

pandas.core.series.Series

In [83]:
students['Course'] # accessing a single column in a dataframe

Student 1    FAI
Student 1     IR
Student 3    CSS
Name: Course, dtype: object

In [84]:
students.T # returns the transpose of the dataframe and makes the columns as indices

       Student 1 Student 1 Student 3
Course       FAI        IR       CSS
Grade         85        96        92
Name    Shashwat  Shashwat    Aatish

In [85]:
students.loc['Student 1', 'Course'] # returns the courses taken by student 1

Student 1    FAI
Student 1     IR
Name: Course, dtype: object

In [86]:
students.loc['Student 3']['Grade'] # accessing individual cells using chaining

92

In [87]:
students.loc['Student 3']['Name'] = 'Shashank' # chaining only creates a copy and the change in value is not reflected
students

D:\Softwares\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

          Course  Grade      Name
Student 1    FAI     85  Shashwat
Student 1     IR     96  Shashwat
Student 3    CSS     92    Aatish

In [88]:
students.loc[:, ['Name', 'Grade']] # to access all rows and specific columns using loc

               Name  Grade
Student 1  Shashwat     85
Student 1  Shashwat     96
Student 3    Aatish     92

In [89]:
copy_students = students.drop('Student 3') # returns a copy of dataframe with the row Student 3 deleted
copy_students

          Course  Grade      Name
Student 1    FAI     85  Shashwat
Student 1     IR     96  Shashwat

In [90]:
students # original dataframe remains intact

          Course  Grade      Name
Student 1    FAI     85  Shashwat
Student 1     IR     96  Shashwat
Student 3    CSS     92    Aatish

In [91]:
students['Grade'] += 2 # applying mathematical operations on the whole column
students

          Course  Grade      Name
Student 1    FAI     87  Shashwat
Student 1     IR     98  Shashwat
Student 3    CSS     94    Aatish

In [93]:
del students['Course'] # deletes the column Course from the dataframe
students

           Grade      Name
Student 1     87  Shashwat
Student 1     98  Shashwat
Student 3     94    Aatish